Repository: BaSysTeam/BaSys.Back
Catalog: src/BaSys.Translation/DictMain.*.resx
Languages: ru

# AddFilesRight
source: Add files
ru: Добавление файлов

# AddRight
source: Add
ru: Добавление

source: App constants record created
ru: Запись констант приложения создана

source: App constants record deleted
ru: Запись констант приложения удалена

source: App constants record updated
ru: Запись констант приложения сохранена

source: Cannot change password
ru: Ошибка изменения пароля

source: Cannot create app constants record
ru: Ошибка создания записи констант приложения

source: Cannot create item
ru: Ошибка создания элемента

# CannotCreateLoggerConfig
source: Cannot create logger config record
ru: Ошибка создания конфигурации логгера

source: Cannot create user
ru: Ошибка создания пользователя

source: Cannot delete app constants record
ru: Ошибка удаления записи констант приложения

source: Cannot delete logger config
ru: Ошибка удаления конфигурации логгера

source: Cannot delete user
ru: Ошибка удаления пользователя

source: CannotDisableUser
ru: Ошибка отключения пользователя

source: Cannot enable user
ru: Ошибка включения пользователя

source: Cannot find app constants record
ru: Запись констант приложения не найдена

source: Cannot find item
ru: Элемент не найден

# CannotFindLoggerConfig
source: Cannot find logger config record
ru: Конфигурация логгера не найдена

source: Cannot find metaobject
ru: Не найден объект метаданных

source: Cannot find metaobject kind
ru: Не найден вид объекта метаданных

source: Cannot find user
ru: Пользователь не найден

source: Cannot get app constants records list
ru: Ошибка получения записей констант приложения

source: Cannot get users list
ru: Ошибка получения списка пользователей

source: Cannot insert item
ru: Не удается вставить элемент

source: Cannot update app constants record
ru: Ошибка сохранения записи констант приложения

source: Cannot update item
ru: Ошибка записи элемента

source: Cannot update logger config
ru: Ошибка сохранения конфигурации логгера

source: Cannot update user
ru: Ошибка сохранения пользователя

# DeleteFilesRight
source: Delete files
ru: Удаление файлов

# DeleteRight
source: Delete
ru: Удаление

# EditRight
source: Edit
ru: Редактирование

source: Empty app constants record list
ru: Список записей констант приложения пуст

# EmptyApplicationTitle
source: The application title should not be empty
ru: Заголовок приложения не должен быть пустым

# EmptyConnectionString
source: The connection string should not be empty
ru: Строка подключения не должна быть пустой

# EmptyLoggerType
source: The logger type should not be empty
ru: Тип логгера не должен быть пустой

# EmptyParentUid
source: The parent uid should not be empty
ru: Родительский идентификатор не должен быть пустой

source: Empty users list
ru: Список пользователей пуст

# FullAccessForMetaObjectKindRight
source: Full access
ru: Полный доступ

source: Item deleted
ru: Элемент удален

source: Item updated
ru: Элемент записан

source: Logger config created
ru: Конфигурация логгера создана

source: Logger config deleted
ru: Конфигурация логгера удалена

source: Logger config updated
ru: Конфигурация логгера обновлена

# OnlyActiveAdministrator
source: The user is the only active administrator
ru: Пользователь единственный активный администратор

# ReadRight
source: Read
ru: Чтение

source: User already exists
ru: Пользователь уже существует

source: User created
ru: Пользователь создан

source: User deleted
ru: Пользователь удален

source: User disabled
ru: Пользователь отключен

source: User enabled
ru: Пользователь включен

source: Users list refreshed
ru: Обновлен список пользователей

source: User updated
ru: Пользователь сохранен

# WrongDataBaseUidFormat
source: Invalid database uid format
ru: Неверный формат идентификатора базы данных

source: Wrong password format
ru: Неверный формат пароля
